app/Controllers/Client/AuthController.php

    public function authenticate() {
        $telephone = $this->request->getPost('telephone');
        if (empty($telephone)) {
            return redirect()->back()->with('error', 'Le numéro de téléphone est requis.');
        }

        $prefixeModel = new PrefixeModel();
        $prefixes = $prefixeModel->findAll();

        $valide = false;
        foreach ($prefixes as $p) {
            if (strpos($telephone, $p['prefixe']) === 0) {
                $valide = true;
                break;
            }
        }

        if (!$valide) {
            return redirect()->back()->with('error', 'Le numéro ne commence pas par un préfixe valide d\'un opérateur.');
        }

        $clientModel = new ClientModel();
        $client = $clientModel->where('telephone', $telephone)->first();

        // S'il n'existe pas encore : inscription et login automatique
        if (!$client) {
            $clientModel->save([
                'nom_clients' => 'Client_' . $telephone, // Nom généré automatiquement par défaut
                'telephone'   => $telephone,
                'solde'       => 0.0
            ]);
            $client = $clientModel->where('telephone', $telephone)->first();
---
SELECT *
FROM `clients`
WHERE `telephone` = '0323232232'
 LIMIT 1
INSERT INTO `clients` (`nom_clients`, `telephone`, `solde`) VALUES ('Client_0323232232', '0323232232', 0)