app/Controllers/Client/CompteController.php

SELECT *
FROM `clients`
WHERE `clients`.`id` = 1
---
    public function dashboard() {
        $clientModel = new ClientModel();
        $client = $clientModel->find(session()->get('id'));