app/Controllers/Client/DepotController.php

SELECT *
FROM `clients`
WHERE `clients`.`id` = 1
UPDATE `clients` SET `solde` = 100000
WHERE `clients`.`id` IN (1)
INSERT INTO `transactions` (`telephone_client`, `telephone_destinataire`, `type_operation`, `montant`, `frais`) VALUES ('0331234567', NULL, 'depot', 50000, 0)
---
    public function store()
    {
        $montant = $this->request->getPost('montant');

        if (empty($montant) || !is_numeric($montant) || (float)$montant <= 0) {
            return redirect()->to(base_url('client/depot'))->with('error', 'Montant invalide.');
        }

        $montant    = (float) $montant;
        $clientId   = session()->get('id');
        $telephone  = session()->get('telephone');
        $db         = \Config\Database::connect();

        $db->transBegin();
        try {
            $clientModel  = new ClientModel();
            $client       = $clientModel->find($clientId);
            $nouveauSolde = $client['solde'] + $montant;

            $clientModel->update($clientId, ['solde' => $nouveauSolde]);

            (new TransactionModel())->insert([
                'telephone_client'       => $telephone,
                'telephone_destinataire' => null,
                'type_operation'         => 'depot',
                'montant'                => $montant,
                'frais'                  => 0.0,
            ]);