app/Controllers/Client/TransfertController.php

    public function store()
    {
        $montant      = $this->request->getPost('montant');
        $telephoneDest = trim($this->request->getPost('telephone_destinataire'));
        $fraisInclus = $this->request->getPost('frais_inclus') === '1';

        if (empty($telephoneDest) || empty($montant) || !is_numeric($montant) || (float)$montant <= 0) {
            return redirect()->to(base_url('client/transfert'))->with('error', 'Données invalides.');
        }
        if ($telephoneDest === session()->get('telephone')) {
            return redirect()->to(base_url('client/transfert'))->with('error', 'Transfert vers vous-même non autorisé.');
        }

        $montant      = (float) $montant;
        $clientModel  = new ClientModel();
        $destinataire = $clientModel->where('telephone', $telephoneDest)->first();
---
SELECT *
FROM `clients`
WHERE `telephone` = '0339876543'
 LIMIT 1


        $db->transBegin();
        try {
            $emetteur = $clientModel->find($emetteurId);
---
SELECT *
FROM `clients`
WHERE `clients`.`id` = 7

            $nouveauSolde = $emetteur['solde'] - $totalDebit;

            // Débiter l'émetteur
            $clientModel->update($emetteurId, ['solde' => $nouveauSolde]);
            // Créditer le destinataire
            $clientModel->update($destinataire['id'], ['solde' => $destinataire['solde'] + $montantNet]);

            $txModel = new TransactionModel();
            // Ligne émetteur
            $txModel->insert([
                'telephone_client'       => $telephoneEmetteur,
                'telephone_destinataire' => $telephoneDest,
                'type_operation'         => 'transfert_envoi',
                'montant'                => $montantNet,
                'frais'                  => $frais,
                'commission'             => $commission,
                'frais_inclus'           => $fraisInclus ? 1 : 0,
            ]);
---
UPDATE `clients` SET `solde` = 9950000
WHERE `clients`.`id` IN (7)
UPDATE `clients` SET `solde` = 47245
WHERE `clients`.`id` IN (8)
INSERT INTO `transactions` (`telephone_client`, `telephone_destinataire`, `type_operation`, `montant`, `frais`, `commission`, `frais_inclus`) VALUES ('0359876543', '0339876543', 'transfert_envoi', 47245, 400, 2355, 1)