app/Controllers/Operateur/AuthController.php

    public function authenticate() {
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        if (empty($username) || empty($password)) {
            return redirect()->back()->with('error', 'Veuillez remplir tous les champs.');
        }

        $operateurModel = new OperateurModel();
        $operateur = $operateurModel->where('username', $username)->first();
---
SELECT *
FROM `operateurs`
WHERE `username` = 'admin'
 LIMIT 1