app/Controllers/Operateur/ReportingController.php

    public function gains()
    {
        $db        = \Config\Database::connect();
        $dateDebut = $this->request->getGet('date_debut');
        $dateFin   = $this->request->getGet('date_fin');

        // Internal gains (fees only)
        $builderInterne = $db->table('transactions t')
            ->select('t.type_operation, SUM(t.frais) as total_frais, COUNT(*) as nb_operations, SUM(t.montant) as total_montant')
            ->join('config_prefixes cp', 'SUBSTR(t.telephone_destinataire, 1, 3) = cp.prefixe OR SUBSTR(t.telephone_client, 1, 3) = cp.prefixe', 'left')
            ->where('cp.type_operateur', 'interne')
            ->whereIn('t.type_operation', ['retrait', 'transfert_envoi']);

        if ($dateDebut) {
            $builderInterne->where('t.date_transaction >=', $dateDebut . ' 00:00:00');
        }
        if ($dateFin) {
            $builderInterne->where('t.date_transaction <=', $dateFin . ' 23:59:59');
        }

        $builderInterne->groupBy('t.type_operation');
        $rowsInterne = $builderInterne->get()->getResultArray();
---
SELECT `t`.`id`, `t`.`type_operation`, `t`.`frais`, `t`.`commission`, `t`.`montant`, `t`.`date_transaction`, `t`.`telephone_client`, `t`.`telephone_destinataire`
FROM `transactions` `t`
LEFT JOIN `config_prefixes` `cp` ON SUBSTR(t.telephone_destinataire, 1, 3) = cp.prefixe OR SUBSTR(t.telephone_client, 1, 3) = cp.prefixe
WHERE `cp`.`type_operateur` = 'interne'
AND `t`.`type_operation` IN ('retrait','transfert_envoi')
ORDER BY `t`.`date_transaction` DESC