app/Controllers/Operateur/ReportingController.php

SELECT `c`.`id`, `c`.`nom_clients`, `c`.`telephone`, `c`.`solde`, `c`.`date_creation`, MAX(t.date_transaction) as derniere_operation
FROM `clients` `c`
LEFT JOIN `transactions` `t` ON `c`.`telephone` = `t`.`telephone_client`
GROUP BY `c`.`id`
ORDER BY `c`.`solde` DESC
---
    public function clients()
    {
        $db     = \Config\Database::connect();
        $search = $this->request->getGet('search');

        $builder = $db->table('clients c')
            ->select('c.id, c.nom_clients, c.telephone, c.solde, c.date_creation, MAX(t.date_transaction) as derniere_operation')
            ->join('transactions t', 'c.telephone = t.telephone_client', 'left')
            ->groupBy('c.id')
            ->orderBy('c.solde', 'DESC');

        if ($search) {
            $builder->like('c.telephone', $search);
        }

        return view('operateur/reporting/clients', [
            'clients' => $builder->get()->getResultArray(),
            'search'  => $search,
        ]);