app/Controllers/Operateur/TypeOperationController.php

SELECT *
FROM `bareme_frais`
WHERE `type_operation` = 'retrait'
ORDER BY `montant_min` ASC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `bareme_frais`
WHERE `type_operation` = 'retrait'
SELECT *
FROM `bareme_frais`
WHERE `type_operation` = 'transfert'
ORDER BY `montant_min` ASC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `bareme_frais`
WHERE `type_operation` = 'transfert'
---
    public function index() {
        $model = new BaremeFraisModel();
        // Regroupement par type pour la vue générale, chacun avec sa propre pagination
        $data['retraits']   = $model->where('type_operation', 'retrait')->orderBy('montant_min', 'ASC')->paginate(10, 'retraits');
        $data['transferts'] = $model->where('type_operation', 'transfert')->orderBy('montant_min', 'ASC')->paginate(10, 'transferts');