app/Models/BaremeFraisModel.php

    public function getFraisForMontant(float $montant, string $type): ?array {
        return $this->where('type_operation', $type)
                    ->where('montant_min <=', $montant)
                    ->where('montant_max >=', $montant)
                    ->first();
---
SELECT *
FROM `bareme_frais`
WHERE `type_operation` = 'transfert'
AND `montant_min` <= 50000
AND `montant_max` >= 50000
 LIMIT 1